---
kind: method
id: M:Autodesk.Revit.DB.FamilyThermalProperties.Dispose
source: html/75cde538-cccd-aa5b-9e53-4ec5d5c085d4.htm
---
# Autodesk.Revit.DB.FamilyThermalProperties.Dispose Method

Releases all resources used by the FamilyThermalProperties

## Syntax (C#)
```csharp
public void Dispose()
```